In [5]:
import pandas as pd

apple = pd.Series([3,2,0,1])
oranges = pd.Series([3,4,7,8])

#print(apple, oranges)
data= {"apple": apple, "oranges": oranges}
fruits_df=pd.DataFrame(data)
print(fruits_df)

   apple  oranges
0      3        3
1      2        4
2      0        7
3      1        8

In [8]:
state = ['Ohio','Ohio','Ohio', 'Nevada','Nevada','Nevada',]
data = {'state': state,
       'year': [2000,2001,2002,2001,2002,2003],
       'pop': [1.5,1.7,3.6,2.4,2.9,3.2]}
state_pop_df = pd.DataFrame(data, index = ['1st','2nd','3rd','4th','5th','6th'])

print(state_pop_df)

      state  year  pop
1st    Ohio  2000  1.5
2nd    Ohio  2001  1.7
3rd    Ohio  2002  3.6
4th  Nevada  2001  2.4
5th  Nevada  2002  2.9
6th  Nevada  2003  3.2

In [18]:
state_pop_df= pd.DataFrame(data, columns=['year','state','pop','debt'],index=['1st','2nd','3rd','4th','5th','6th'] )
state_pop_df

#state_pop_df.head()
#head() sy shuru ki 5 values print hongi
#tail() sy akhri ki 5 values print hongi

     year   state  pop debt
1st  2000    Ohio  1.5  NaN
2nd  2001    Ohio  1.7  NaN
3rd  2002    Ohio  3.6  NaN
4th  2001  Nevada  2.4  NaN
5th  2002  Nevada  2.9  NaN
6th  2003  Nevada  3.2  NaN

In [20]:
print(state_pop_df.columns)
print(state_pop_df.index)

Index(['year', 'state', 'pop', 'debt'], dtype='object')
Index(['1st', '2nd', '3rd', '4th', '5th', '6th'], dtype='object')

In [21]:
frame2=state_pop_df
frame2

     year   state  pop debt
1st  2000    Ohio  1.5  NaN
2nd  2001    Ohio  1.7  NaN
3rd  2002    Ohio  3.6  NaN
4th  2001  Nevada  2.4  NaN
5th  2002  Nevada  2.9  NaN
6th  2003  Nevada  3.2  NaN

In [22]:
frame2['state']

1st      Ohio
2nd      Ohio
3rd      Ohio
4th    Nevada
5th    Nevada
6th    Nevada
Name: state, dtype: object

In [23]:
frame2.year

1st    2000
2nd    2001
3rd    2002
4th    2001
5th    2002
6th    2003
Name: year, dtype: int64

In [24]:
frame2['debt']=16.5
frame2

     year   state  pop  debt
1st  2000    Ohio  1.5  16.5
2nd  2001    Ohio  1.7  16.5
3rd  2002    Ohio  3.6  16.5
4th  2001  Nevada  2.4  16.5
5th  2002  Nevada  2.9  16.5
6th  2003  Nevada  3.2  16.5

In [28]:
import numpy as np
ln= len(frame2) #finding no. of rows in dataframe
rng=np.arange(ln)
print(rng)
frame2['debt']=rng
frame2

[0 1 2 3 4 5]

     year   state  pop  debt
1st  2000    Ohio  1.5     0
2nd  2001    Ohio  1.7     1
3rd  2002    Ohio  3.6     2
4th  2001  Nevada  2.4     3
5th  2002  Nevada  2.9     4
6th  2003  Nevada  3.2     5

In [54]:
#REINDEXING

#ffil= forward fill
#bfill=backwars fill


obj3=pd.Series(['blue','purple','yellow'], index=[0,3,6])
print(obj3)
#bj3=obj3.reindex(range(9))
#rint(obj3)
obj3=obj3.reindex(range(9), method='ffill')
print(obj3)
#bj3=obj3.reindex(range(2,11), method='ffill')
#rint(obj3)

0      blue
3    purple
6    yellow
dtype: object
0      blue
1      blue
2      blue
3    purple
4    purple
5    purple
6    yellow
7    yellow
8    yellow
dtype: object

In [16]:
import numpy as np
import pandas as pd

data_df = pd.DataFrame(np.arange(16).reshape((4,4)),
                         index=['Ohio','Colorado','Utah','New York'],
                         columns=['one','two','three','four'])
print(data_df,"\n")

#data_df=data_df.drop('two',axis=1)
data_df.drop('two', axis=1, inplace=True)
print(data_df)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [26]:
data_df = pd.DataFrame(np.arange(16).reshape((4,4)),
                         index=['Ohio','Colorado','Utah','New York'],
                         columns=['one','two','three','four'])
print(data_df,"\n")
df2=data_df[["one","three"]]
print(df2,"\n")
print(data_df[2:],"\n") #same like numpy
print(data_df["one"],"\n") #dictionary like style of accessing data
print(data_df.one[2:],"\n") #filter on both row and columns
# #Conditiional Selection
print(data_df.three[data_df["three"]>5])
print(data_df, "\n")

# df2 = data_df["three"]>5 #boolean dataframe
# print[df2]
# print( data_df [data_df["three"] > 5 ])

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32

Utah         8
New York    12
Name: one, dtype: int32

Colorado     6
Utah        10
New York    14
Name: three, dtype: int32
          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [33]:
print(data_df,"\n\n")
print(data_df.iloc[2:, [0,1,3]])

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15


          one  two  four
Utah        8    9    11
New York   12   13    15

In [ ]:
df1